#+title: Révision finale pour IFT1016B
#+author: frederic boileau
#+email: frederic.boileau@protonmail.com
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="blog.css" />
#+OPTIONS: toc:nil num:nil html-style:nil
#+startup:  inlineimages lognoteclock-out hideblocks


* liens utiles

- Pour poser des questions : https://discord.gg/jTu9aWW
- La documentation de Mozilla en ligne est excellente. Je vous conseille
  de vous rafraîchir la mémoire sur par exemple:
  [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/charAt][String.prototype.charAt() - JavaScript | MDN]]



* documents

- [[file:solutionnaireAncienFinal.org][solutionnaire ancien final]]

- [[file:tortue.org][tortue]]

- types ::

- Boucles :: in progress

- tableaux :: in progress

* publish settings :noexport:
** wiki
#+BEGIN_SRC emacs-lisp
(setq org-wiki-location "~/nouveauAux/")
#+END_SRC

#+RESULTS:
: ~/nouveauAux/

** project alist
#+BEGIN_SRC emacs-lisp
(setq org-publish-project-alist
      '(("demos-org"
         :base-directory "~/nouveauAux"
         :base-extension "org"
         :publishing-directory "~/nouveauAux/docs"
         :recursive t
         :exclude "*/ignore/*"
         :publishing-function org-html-publish-to-html
         :headline-levels 4             ; Just the default for this project.
         :auto-preamble t)

        ("demos-static"
         :base-directory "~/nouveauAux/"
         :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
         :publishing-directory "~/nouveauAux/publish/static"
         :recursive t
         :publishing-function org-publish-attachment)

        ("demos" :components ("demos-org" "demos-static"))))
#+END_SRC

#+RESULTS:
| demos-org    | :base-directory | ~/nouveauAux             | :base-extension | org  | :publishing-directory | ~/nouveauAux/publish | :recursive | t    | :exclude | */ignore/* | :publishing-function | org-html-publish-to-html | :headline-levels      |                           4 | :auto-preamble | t |                      |                        |
| demos-static | :base-directory | ~/nouveauAux/            | :base-extension | css\ | js\                   | png\                 | jpg\       | gif\ | pdf\     | mp3\       | ogg\                 | swf                      | :publishing-directory | ~/nouveauAux/publish/static | :recursive     | t | :publishing-function | org-publish-attachment |
| demos        | :components     | (demos-org demos-static) |                 |      |                       |                      |            |      |          |            |                      |                          |                       |                             |                |   |                      |                        |
